import type { 空白, 构造格子内容, 数字, 炸弹 } from './index'
export type 随机游戏 = [
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<空白>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 3>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 1>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 3>,
    构造格子内容<炸弹>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 3>,
    构造格子内容<炸弹>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 3>,
    构造格子内容<数字, 2>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 2>,
    构造格子内容<数字, 2>,
    构造格子内容<炸弹>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<炸弹>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<数字, 1>,
    构造格子内容<空白>,
    构造格子内容<空白>
  ],
  [
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>,
    构造格子内容<空白>
  ]
]
